In [1]:
import numpy as np
import pandas as pd

### Dataframe

Equivalent to matlab dataframe

In [2]:
the_data=np.array([[5,2],[5,5],[6,2],[4,1],[4,10]])

col_names=['temperature','age']

the_dataframe=pd.DataFrame(data=the_data,columns=col_names)
print(the_dataframe)

   temperature  age
0            5    2
1            5    5
2            6    2
3            4    1
4            4   10

In [3]:
the_dataframe

   temperature  age
0            5    2
1            5    5
2            6    2
3            4    1
4            4   10

In [4]:
the_dataframe['age_regressed']=the_dataframe.age+2
the_dataframe

   temperature  age  age_regressed
0            5    2              4
1            5    5              7
2            6    2              4
3            4    1              3
4            4   10             12

In [5]:
the_dataframe.head(2)

   temperature  age  age_regressed
0            5    2              4
1            5    5              7

In [6]:
the_dataframe.iloc[[2]]

   temperature  age  age_regressed
2            6    2              4

In [7]:
the_dataframe.iloc[2]

temperature      6
age              2
age_regressed    4
Name: 2, dtype: int32

In [8]:
the_dataframe[0:2]

   temperature  age  age_regressed
0            5    2              4
1            5    5              7

In [9]:
the_dataframe['age'][4]

10

### Dataframe Referencing & Copying

In [10]:
reference_to_the_dataframe=the_dataframe

In [11]:
reference_to_the_dataframe.at[0,'age_regressed']

4

In [12]:
the_dataframe.at[0,'age_regressed'] = 89

In [13]:
reference_to_the_dataframe.at[0,'age_regressed']

89

In [14]:
copy_of_df=the_dataframe.copy()

In [15]:
copy_of_df.at[1,'age']

5